# Pandas

In [ ]:
import numpy as NP
import pandas as PD

In [ ]:
Df = PD.DataFrame({"Name":PD.Series(["Alice","Pritam","Priya"]),"Age":PD.Series([24,26,28])})
Df

     Name  Age
0   Alice   24
1  Pritam   26
2   Priya   28

In [ ]:
Df["Hight"] = PD.Series([5.2,6.8,4.4])
Df

     Name  Age  Hight
0   Alice   24    5.2
1  Pritam   26    6.8
2   Priya   28    4.4

In [ ]:
Df = PD.read_csv("/content/Salaries.csv")
Df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

Top Rows/ Bottom Rows

In [ ]:
Df.head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [ ]:
Df.tail(4)

         rank discipline  phd  service     sex  salary
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

Total Shape

In [ ]:
Df.shape

(78, 6)

Total Size

In [ ]:
Df.size

468

Name of Column

In [ ]:
Df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

Type of DataFrame (Number, Int, Date and many)

In [ ]:
Df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

Number of dimentions for this Dataset

In [ ]:
Df.ndim

2

To Check Axis of Rows and Columns

In [ ]:
Df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

Type of Df

In [ ]:
type(Df)

pandas.core.frame.DataFrame

DataFrame to Numpy Array

In [ ]:
Df_1 = Df.values # Converting DatFrame into Numpy Array
type(Df_1)

numpy.ndarray

##Statistics
If i want Statistics for Whole Data

In [ ]:
# describe
Df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

If i want Syayistics for one colomn

In [ ]:
Df["service"].describe()

count    78.000000
mean     15.051282
std      12.139768
min       0.000000
25%       5.250000
50%      14.500000
75%      20.750000
max      51.000000
Name: service, dtype: float64

## Data Slicing and Grouping

**Grouping**

## Mean Data on the basis on Rank

In [ ]:
# Manking a group on the basis of Rank(One column)
Df_Rank = Df.groupby("rank")  # Df_Rabk = New DataFrame  
# Df is the old Datafram   
# groupby is the function 
# Rank is the column on the basis of whwich we are making group
Df_Rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

## Mean salary for Male and Female

In [ ]:
# Mean salary for male and Female
Df_Sex = Df.groupby("sex")

# To Access all Data
Df_Sex.mean()

# To Access only one particualr Catagory
Df_Sex[["service"]].mean()  # Salary for male and female

          service
sex
Female  11.564103
Male    18.538462

## Sorting with Grouping

## Grouping on the basis Rand and sort into Decending order

In [ ]:
Df.groupby("rank",sort = False)[["salary" ]].mean()  # False = Decending Order

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

## Filtering
## Subset of Data

Salary whose is grater then 160000

In [ ]:
Df_Sub = Df[Df["salary"] >160000]
Df_Sub

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101

Mean value of the Salary for discipline A

In [ ]:
Df_Sub_1 = Df[Df["discipline"] == "A"]["salary"].mean()
Df_Sub_1

98331.11111111111

Extract (filter) only observations with high salary ( > 100K) and find how many female and male professors in each group

In [ ]:
Df_Sub_2 = Df[Df["salary"] > 100000].groupby("sex")[["salary"]].count()
Df_Sub_2

        salary
sex
Female      21
Male        25

**Slicing**

In [ ]:
# To access one column
Df["salary"]

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [ ]:
# To Access 2 column
Df[["rank","salary"]]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
..        ...     ...
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

[78 rows x 2 columns]

In [ ]:
# This will give Rows from 10-20 with all column
Df[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500

**Iloc Function**

In [ ]:
# iloc is the function
# [10:20,[0,3,4,5]]where 10:20 is the rows and [0,3,4,5] is the Column Number 
Df.iloc[10:20,[0,3,4,5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

In [ ]:
# It will give only 1st Rows
Df.iloc[[0]]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960

In [ ]:
Df.iloc[:,1:3]

   discipline  phd
0           B   56
1           A   12
2           A   23
3           A   40
4           B   20
..        ...  ...
73          B   18
74          B   19
75          B   17
76          A   28
77          A   23

[78 rows x 2 columns]

In [ ]:
Df.iloc[1:3,0:3]

   rank discipline  phd
1  Prof          A   12
2  Prof          A   23

**Loc Function**

Loc is used when You knw the Colomn name

In [ ]:
Df.loc[10:20,["rank","salary"]]

        rank  salary
10      Prof  128250
11      Prof  134778
12  AsstProf   88000
13      Prof  162200
14      Prof  153750
15      Prof  150480
16  AsstProf   75044
17  AsstProf   92000
18      Prof  107300
19      Prof  150500
20  AsstProf   92000

## Sorting

In [ ]:
Df_Sort = Df.sort_values(by= "discipline")
Df_Sort.head()

        rank discipline  phd  service     sex  salary
77      Prof          A   23       15  Female  109646
23  AsstProf          A    2        0    Male   85000
65      Prof          A   36       19  Female  117555
26      Prof          A   38       19    Male  148750
27      Prof          A   45       43    Male  155865

Assending and Decending

In [ ]:
# Ascending
  Df.sort_index(ascending=True)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [ ]:
# Decending
Df.sort_index(ascending=False)

         rank discipline  phd  service     sex  salary
77       Prof          A   23       15  Female  109646
76       Prof          A   28       14  Female  109954
75       Prof          B   17       17  Female  124312
74  AssocProf          B   19        6  Female  104542
73       Prof          B   18       10  Female  105450
..        ...        ...  ...      ...     ...     ...
4        Prof          B   20       18    Male  104800
3        Prof          A   40       31    Male  131205
2        Prof          A   23       20    Male  110515
1        Prof          A   12        6    Male   93000
0        Prof          B   56       49    Male  186960

[78 rows x 6 columns]

In [ ]:
Df.sort_values(by=["service","salary"], ascending=[True,False])

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
..       ...        ...  ...      ...     ...     ...
40      Prof          A   39       36  Female  137000
27      Prof          A   45       43    Male  155865
36      Prof          B   45       45    Male  146856
0       Prof          B   56       49    Male  186960
9       Prof          A   51       51    Male   57800

[78 rows x 6 columns]

## Aggregation Fuctions

**agg** - agg is function is used use mone then one Aggregation function(mean, max, min, ...)

In [ ]:
Df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [ ]:
Df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [ ]:
Df[["salary","service"]].agg(["min","mean","max"])

             salary    service
min    57800.000000   0.000000
mean  108023.782051  15.051282
max   186960.000000  51.000000

3 Aggregation function for 1 column and 1 or 2 aggregation function for another Column

In [ ]:
Df.agg({"salary":["mean","max","min"],"service":["max","min","mean","unique"]})

               salary                                            service
max     186960.000000                                                 51
mean    108023.782051                                            15.0513
min      57800.000000                                                  0
unique            NaN  [49, 6, 20, 31, 18, 17, 19, 51, 33, 23, 0, 3, ...